{"pageProps":{"id":"2021-04-17-year-of-art","year":"2021","month":"04","day":"17","slug":"year-of-art","content":"<p>(TODO header on the blog post)</p>\n<p>In this article, i&#39;ll do a tour of many things i&#39;ve explored the past months: Shaders, Plots, NFTs,... Apologies for the long article, but it shows how crazy I have explored in the past weeks and months. Maybe 2 images summarize it all after all:</p>\n<p><img width=\"50%\" src=\"/profile_laserblue.gif\" /><img width=\"50%\" src=\"/profile_plot.jpg\" /></p>\n<h2 id=\"hey-its-greweb-im-back\">Hey, it&#39;s @greweb, i&#39;m back!</h2>\n<p>Welcome back to my blog. You may notice I&#39;ve been silent here for a few years, no more blog posts, not a lot of creations or games made neither... well there is life as busy and passionate it can be: I&#39;ve been continuing to learn Chinese, growing kids, doing archery, lot of gardening,... and work!</p>\n<p><strong>The year 2021 is a reborn of creativity for me.</strong> Despite the depressing pandemic context (we&#39;re getting bored at home), 2021 generally feels like the year of art. Maybe it&#39;s my bubble? my niche circle? the intersection of my crypto devs twitter sphere and demosceners/artists crypto sphere? Well, whatever this is, it has been incredible to see all these worlds colliding and converging to art around me. Specifically I&#39;ve been working in the crypto currencies industry for the past 3 years now (as <a href=\"https://www.ledger.com/\">Ledger Live</a> tech lead), the market has been pretty bearish these past years but this year have bullrun and welcome a lot of artists jumping into the &quot;crypto art&quot; fun with NFTs.</p>\n<p><strong>I&#39;m going back to my origins!</strong> As a kid, I always has been attracted by art, as a teenager I was in a drawing club, mainly <a href=\"https://twitter.com/greweb/status/1368570431029063684\">doing dry paster</a> which is pretty straightforward and interesting. A bit later, I fade away from drawing to computer. I was spending countless hours on Blender and 3D modeling, before I even was into programming. I was doing many visuals already –to impress a bit friends– without really knowing what &quot;demoscene&quot; was. Years later, as a developer, I&#39;ve continued creating with code, challenging myself in many area, notably Canvas 2D and WebGL. I did <a href=\"https://greweb.itch.io/\">many mini games</a> over last years because it&#39;s such a great field to learn so many different skills. Life is a bit a cycle, now I really feel i&#39;m closer than ever than my childhood, and still in pursuit to learn new things.</p>\n<p>On these days, i&#39;m a lucky creative coder, a weirdo noise explorer, spending hours exploring the beauty of perlin noise.</p>\n<h2 id=\"shader-all-the-things\">Shader all the things</h2>\n<p>A few years ago, I&#39;ve created and actively maintain <a href=\"https://gl-react-cookbook.surge.sh/\">gl-react</a> which brings OpenGL Shaders to the web and specifically to React. There are two goals in this library: making it easy for newlearners to get into shaders, making it very straightforward to implement image effects, possibility even without knowing how to implement a shader, if someone wrote that effect, it&#39;s just React component composition. I had the chance to work on this in the context of my work (back in the days at ProjectSeptember in New York, we had very specific needs).</p>\n<p>Ending 2020, when France started its lockdown again I wanted to do something every day. I wanted to go back to write again some shaders, that&#39;s how I started &quot;One day, One shader&quot; – later renamed &quot;shaderday&quot;. I managed to do this for about 60 days which is a great accomplishement. I will continue it on a less regular pace. My work is available on <a href=\"https://greweb.me/shaderday\">https://greweb.me/shaderday</a>. This first series of days has been interesting to me as I rediscovered some minimalism as well as 3D raymarching techniques.</p>\n<p><img src=\"/images/2021/04/stripes.gif\" width=\"33%\" /><img src=\"/images/2021/04/chess.jpg\" width=\"33%\" /><img src=\"/images/2021/04/bank.jpg\" width=\"33%\" /></p>\n<p>There are so many interesting creative coders in shaders space and I wouldn&#39;t be there without their incredible talent. I&#39;m thinking about artists like <a href=\"https://www.iquilezles.org/\">Inigo Quilez</a> or <a href=\"https://thebookofshaders.com/\">Patricio Gonzalez Vivo</a> (to only quote two of them). Platforms like <a href=\"https://www.shadertoy.com/\">Shadertoy</a> are incredible resourceful if you like to &quot;learn by code&quot; like me.</p>\n<h2 id=\"plot-all-the-things\">Plot all the things</h2>\n<p>For the new year 2021 I decided to learn Rust language and I needed a purpose to learn it. I followed a bit a twitter trend and decided to join the <a href=\"https://twitter.com/search?q=%23plottertwitter\">#plottertwitter</a> game. I initially did a poor hardware choice (I bought a cheap plotter on amazon) and was disappointed by its precision. I did more studies and felt on the AxiDraw choice which I don&#39;t regret. Very good material, it need some budget on the price (~500$) but definitely worth it.</p>\n<p>Conceptually it&#39;s pretty simple: 2 axis (2 motors) and one &quot;pen lifter&quot;, you put a pen in the holder and you instruct it to draw some strokes.</p>\n<p>Practically it has been a great journey with a lot of things to learn on pens, papers and plotting tricks. At the same time I had to learn a totally new programming language. It was a fun fight to try to get things done and fight against the elements!</p>\n<p>I still can&#39;t believe we can use fountain pens with this:</p>\n<img src=\"/images/2021/04/plot-parametric.gif\" width=\"100%\" />\n\n<h3 id=\"one-plot-per-day-since-january-1th-2021\">one plot per day, since January 1th, 2021</h3>\n<p>I usually will plot by batch but I managed to keep the pace of releasing one plot per day, and every day it&#39;s a new Rust script that gets published on <a href=\"https://github.com/gre/gre\">https://github.com/gre/gre</a>. I even did a few livestream on <a href=\"https://twitch.tv/greweb\">Twitch</a> which I paused a bit because it&#39;s hard to keep focus and performance.</p>\n<p>I don&#39;t have a gallery on my website yet, but I used to put them all on a wall which I have early picture of that:</p>\n<img src=\"/images/2021/04/wall.jpg\" width=\"100%\" />\n\n<p>I stopped putting things on my wall because I have more creation that could fit on my wall now =D</p>\n<p>For now, you can find them all on my homepage at <a href=\"https://greweb.me\">greweb.me</a> or in my <a href=\"https://twitter.com/greweb\">Twitter history</a>.</p>\n<h2 id=\"nft-all-the-things\">NFT all the things</h2>\n<p>Non Fungible Token. What a simple idea, but that fit so well with what crypto currencies have achieved so far. If you don&#39;t know what it is, a must much is <a href=\"https://www.youtube.com/watch?v=Y-i9Jsm95ro\">Andreas Antonopoulos&#39;s video</a>. Ultimately, NFT attach data on a blockchain (mainly Ethereum, but we see emergence of alternatives), and most of today&#39;s NFT platform are a pointer to IPFS. An URL basically.</p>\n<p>I keep asking myself: is it a bubble? what will remain out of this? I&#39;ve tried a bunch of exploration on the topic. And as many things I do, I like to push to limits and go a bit meta.</p>\n<h3 id=\"where-i-come-from-my-work-at-ledger\">Where I come from: my work at Ledger</h3>\n<p>We&#39;ve all heard about NFT a few years ago with concepts like <a href=\"https://www.cryptokitties.co/\">CryptoKitties</a>, at least at Ledger it always has been a topic of curiosity, that and great tutorials like <a href=\"https://cryptozombies.io/\">CryptoZombies</a>... But this year the emergence of NFT is going crazily mainstream.</p>\n<p>For me it really started on March 1th, where I started my own investigation of NFT platforms out there. I did this for curiosity, both creative and technical. But I also happen to work at Ledger, where we make this famous secured hardware wallet.</p>\n<img src=\"/images/2021/04/nanos.jpg\" width=\"100%\"/>\n\n<p>I wanted to study where are NFT really secured. Ledger have a good leadership on hardware wallet and generally a good integration in web apps, but in context of very young NFT platforms there are not a lot of guidance out there (I didn&#39;t see a lot of NFT tutorials to even mention the possibility to use a hardware wallet) and it is not even possible to use a Ledger device on some platform. The main status quo today is to use software wallets, usually browser extensions, and these <a href=\"https://www.ledger.com/academy/crypto/the-best-way-to-store-your-private-keys-hardware-wallets\">aren&#39;t necessary the most secured options.</a>.</p>\n<p>Some of these &quot;crypto wallet browser extension&quot; will have the option &quot;Use a hardware wallet&quot; but it&#39;s not really made first class citizen. Clearly, there are always room to improve and we plan to deliver something this year. I work in Ledger Live team and we are keen to address the UX in even better ways than what you can do today when it comes to dapps. I always see this the biggest challenge of Ledger: when it comes to a physical hardware wallet, how do you also try to bring the best user experience with it?</p>\n<h4 id=\"so-whats-the-tldr-of-the-investigation\">So what&#39;s the TLDR of the investigation?</h4>\n<p>What&#39;s sure is that Ethereum is a bit the king blockchain platform for NFT, and for Ethereum it usually falls down to MetaMask which does support Ledger hardware wallet. Now, and until we don&#39;t get ETH 2 or wide support for Layer 2 platforms, the sudden raise of fees (it costs a lot to do even regular actions on Ethereum) have turned many to new alternatives.</p>\n<p>Alternative platforms I&#39;ve personally explored (non exhaustive and personal):</p>\n<ul>\n<li><strong>Tezos</strong> blockchain + hicetnunc.xyz – great support of Ledger hardware with Temple wallet (even tho you have to hack your way around to chose &quot;use a hardware wallet&quot;, but like in Metamask)</li>\n<li><strong>WAVES</strong> blockchain + sign-art.app – unfortunately no support of Ledger wallet on this dapp, but I think it&#39;s technically possible with current hardware and apps.</li>\n<li><strong>Polkadot / KodaDot</strong> blockchain + kodadot.xyz – unfortunately no support of Ledger wallet at this stage. Something is broken on the &quot;batch transactions&quot; support.</li>\n<li><strong>Phantasma</strong> blockchain + ghostmarket.io – unfortunately no support of Ledger hardware at this stage (not even in the hardware).</li>\n</ul>\n<p>To summarized, only Ethereum and Tezos are currently really good in term of Ledger support at this stage.</p>\n<h3 id=\"ethblockart-creative-visualization-of-ethereum-blocks\">EthBlock.art: creative visualization of Ethereum blocks</h3>\n<p>I&#39;ve found <a href=\"https://ethblock.art\">ethblock.art</a> idea brilliant and innovative. The way I see this is that it&#39;s a virtuous ecosystem, similar to <a href=\"https://en.wikipedia.org/wiki/Value_chain\">Supply Chain Transformation concepts</a> with a few actors, as explained here:</p>\n<p><img src=\"/images/posts/cryptoaliens/ethblockart.png\" alt=\"\"></p>\n<p>I&#39;m currently the author of 4 block styles but there are currently 21 other to discover at <a href=\"https://ethblock.art/styles\">ethblock.art/styles</a>.</p>\n<p><img src=\"/images/blockstyles/17.jpg\" width=\"25%\"/><img src=\"/images/blockstyles/18.png\" width=\"25%\"/><img src=\"/images/blockstyles/19.png\" width=\"25%\"/><img src=\"/images/blockstyles/24.png\" width=\"25%\"/></p>\n<p>This is totally aligned to everything I like about generative art. I&#39;m a creative coder, I write code for everything and I like this idea to split the concerns between the creative coder and the visual artist who will search a lot to find something they like.</p>\n<h3 id=\"hicetnuncxyz-the-nft-hive-of-experiments\">hicetnunc.xyz, the NFT hive of experiments</h3>\n<p>Tezos blockchain and specifically hicetnunc.xyz platform has become extremely popular among my artist sphere and I&#39;ve also jumped into it.</p>\n<p>I&#39;ve started minting experiments from my previous work (shaders mostly, images and videos) but then, about one week after, someone figured out one could upload .SVG with JavaScript in it and literally have script that runs out of an NFT. It felt scary at first but they secured this in an <code>&lt;iframe</code> with the <code>sandbox</code> mecanism that do not allows it to query the outside world.</p>\n<p>Later on, they even made it more &quot;first class citizen&quot; and less hacky but the simple support of an HTML zip archive.</p>\n<h3 id=\"nft-iframe-html-scripts-can-we-push-it-farther\">NFT iframe, html, scripts,... Can we push it farther?</h3>\n<p>With a bit of curiosity and a tiny bit of troll/sarcasm/self-mockery of this whole thing. I decided to start a bunch of &quot;concepts&quot;. Some art concepts, some are real thing that could be useful for some, in any case, i&#39;m having fun and it&#39;s all that matters.</p>\n<h3 id=\"game-as-an-nft\">Game as an NFT</h3>\n<p>On that weekend where the idea emerged, many of us made game as an NFT. I released 4 of our my previous games in NFT. It&#39;s convenient because in the past years, I&#39;ve always made my game very minimalist in that they were usually for code golf competitions = basically they stick in very small amount of kilobytes, so they could easily fit in a .svg!</p>\n<h4 id=\"panzer1k-2d-shooter\">&#39;Panzer1k&#39; 2d shooter</h4>\n<p><a href=\"https://www.hicetnunc.xyz/objkt/9099\">https://www.hicetnunc.xyz/objkt/9099</a></p>\n<img src=\"/images/2021/04/panzer1k.gif\"/>\n\n<ul>\n<li>3d maze <a href=\"https://www.hicetnunc.xyz/objkt/13177\">https://www.hicetnunc.xyz/objkt/13177</a></li>\n<li>‘behind asteroids’ <a href=\"https://www.hicetnunc.xyz/objkt/9208\">https://www.hicetnunc.xyz/objkt/9208</a></li>\n<li>world simulated with some ibex animals <a href=\"https://www.hicetnunc.xyz/objkt/11878\">https://www.hicetnunc.xyz/objkt/11878</a></li>\n</ul>\n<h3 id=\"general-tools\">General tools</h3>\n<h4 id=\"crypto-eyes\">Crypto Eyes</h4>\n<p><a href=\"https://hicetnunc.xyz/objkt/36282\">https://hicetnunc.xyz/objkt/36282</a></p>\n<blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"><a href=\"https://t.co/wDkTgQipHh\">https://t.co/wDkTgQipHh</a> v1.0.1 – fixed for GIF export on non square images. I&#39;ve sent the 2 buyers of yesterday a copy of this new version and i&#39;ve burned all the previous <a href=\"https://twitter.com/hashtag/nft?src=hash&amp;ref_src=twsrc%5Etfw\">#nft</a> version. supply is lowered to 100. <a href=\"https://t.co/gpaIXGi7jn\">pic.twitter.com/gpaIXGi7jn</a></p>&mdash; 𝗚aëtan 𝗥𝗘naudeau (@greweb) <a href=\"https://twitter.com/greweb/status/1383326182762975233?ref_src=twsrc%5Etfw\">April 17, 2021</a></blockquote> <script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n\n<p>Some famous artist have even tried it!</p>\n<blockquote class=\"twitter-tweet\"><p lang=\"und\" dir=\"ltr\"><a href=\"https://twitter.com/greweb?ref_src=twsrc%5Etfw\">@greweb</a> :) <a href=\"https://t.co/xS59pbMVD1\">pic.twitter.com/xS59pbMVD1</a></p>&mdash; ᴊᴏᴀɴɪᴇ ʟᴇᴍᴇʀᴄɪᴇʀ (@JoanieLemercier) <a href=\"https://twitter.com/JoanieLemercier/status/1383183295333163010?ref_src=twsrc%5Etfw\">April 16, 2021</a></blockquote> <script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n\n<h3 id=\"plots-and-nfts-why-not-both\">Plots and NFTs, why not both?!</h3>\n<p>Yes, more recently, and in recent celebration of my 100th day, I&#39;ve actually put a lot of plot for sale as an NFT. The NFT acts as a &#39;proof of buy&#39;.</p>\n<p>I essentially put together 4 main collections out of my 100 first plots:</p>\n<p><strong>They can still be found at <a href=\"https://hic.link/greweb\">hic.link/greweb</a> but I may burn they at some point by the way</strong> (to expire them, the NFT not the original plot!)</p>\n<h2 id=\"future-is-great\">Future is great</h2>\n<p>At the end of the day, I always feel a lucky kid among big players, there are so many big artists and creative coders. This is very inspiring and always give me more ideas to see incredible work from other artists. It has been a fun playground to mint and buy other artists some NFTs. I feel very honored to have sell a bunch of NFTs, discussed with so many different people (in this lockdown context) and even sold 5 physical plots so far, using an NFT as a proof of buy. I believe this is one of the usecase that may remain on the long run, attaching NFT certificate to physical art and using it as a mean to trade.</p>\n<p>I still have a lot to learn. I still have a lot of ideas to try out. I still have to find what is my art! But what a journey so far.</p>\n","data":{"title":"2021, the year of art","thumbnail":"/profile_plot.jpg","description":"2021 is a creativity reborn for me. Notes on what i've been doing the past months. Shaders, plots, NFTs,...","tags":["plot","NFT","shaders"]}},"__N_SSG":true}